Revit 2027 API
ParameterTypeId.FabricationPartDepthOutOption Property
 "Main Secondary Depth Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartDepthOutOption { get; }
Public Shared ReadOnly Property FabricationPartDepthOutOption As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartDepthOutOption {
	ForgeTypeId^ get ();
}
static member FabricationPartDepthOutOption : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace